[Strings]
app_title=YaToML
col_key=Ключ
col_type=Тип
col_value=Значение
column_label=Столбец
document_label=Документ
err_cannot_open_file=Не удалось открыть файл.
err_cannot_open_for_write=Не удалось открыть файл для записи.
err_display_internal=Внутренняя ошибка при отображении файла:
err_display_unknown=Неизвестная внутренняя ошибка при отображении файла.
err_incomplete_write=Не удалось записать файл полностью.
err_save_aborted_verification=Сохранение прервано: проверка безопасности не пройдена. Файл НЕ был изменён.
err_unexpected_internal=Неожиданная внутренняя ошибка: 
err_unknown_parse=Неизвестная внутренняя ошибка при разборе.
kind_alias=Алиас
kind_bool=Bool
kind_datetime=Дата/время
kind_float=Float
kind_integer=Integer
kind_list=Список
kind_map=Map
kind_null=Null
kind_string=String
line_label=Строка
menu_collapse_all=Свернуть всё
menu_copy_key=Скопировать ключ
menu_copy_value=Скопировать значение
menu_edit_value=Редактировать	F2
menu_expand_all=Развернуть всё
menu_navigate=Перейти к узлу дерева
menu_save=Сохранить	Ctrl+S
msg_parse_error_cannot_save=В этом файле есть ошибка разбора, сохранение невозможно.
msg_saved_with_hints=Сохранено, но с замечаниями:
parse_error_label=Ошибка разбора
preview_alias_prefix=[Алиас -> 
preview_list=[Список]
preview_map=[Map]
save_failed_suffix=Ошибка сохранения
status_unsaved=Несохранённые изменения
verify_structure_child_count=Расхождение структуры после патча (количество дочерних элементов).
verify_structure_doc_count=Расхождение структуры после патча (количество документов).
verify_structure_node_type=Расхождение структуры после патча (тип узла).
verify_unexpected_change=Неотредактированное значение неожиданно изменилось.
verify_value_mismatch=Сохранённое значение не соответствует ожидаемому новому значению.
warn_block_scalar=Многострочное блочное значение (|/>) НЕ было сохранено (этот случай пока не поддерживается).
warn_could_not_locate=Не удалось безопасно определить положение изменённого значения, оно НЕ было сохранено.
warn_flow_container=Значение внутри flow-структуры ([...]/{...}) НЕ было сохранено (этот случай пока не поддерживается).
warn_internal_position_error=Внутренняя ошибка позиции для изменённого значения -- НЕ сохранено.
warn_invalid_datetime_prefix=Недопустимое значение даты «
warn_invalid_datetime_suffix=» НЕ было сохранено (сохранено исходное значение).
warn_no_position=Изменённое значение без известной позиции НЕ было сохранено.
warn_unexpected_value=Неожиданное значение НЕ было сохранено (сохранено исходное значение).
warn_verify_failed_prefix=Проверка безопасности не пройдена (
warn_verify_failed_suffix=) -- НИЧЕГО не было сохранено.
warn_verify_nothing_saved=НИЧЕГО не было сохранено.
warn_verify_original_unparsable=оригинал не удаётся разобрать заново
warn_verify_unparsable=Проверка безопасности не пройдена (результат больше не парсится) -- 
